app/views/lessons/index.html.erb

SELECT "readings".* FROM "readings" WHERE "readings"."lesson_id" = ?  [["lesson_id", 31]]
---
    <% lessons.each do |lesson| %>
    <% if lesson.readings.any? %>

SELECT "homeworks".* FROM "homeworks" WHERE "homeworks"."lesson_id" = ?  [["lesson_id", 31]]
---
        <% lessons.each do |lesson| %>
        <% if lesson.homeworks.any? or lesson.assignments.any? %>