app/controllers/lessons_controller.rb

  def index
  @search = Lesson.search(params[:q])
---
SELECT "lessons".* FROM "lessons"

  def create
    @lesson = Lesson.new(lesson_params)
    @lesson.user_id = current_user.id

    respond_to do |format|
      if @lesson.save
---
INSERT INTO "lessons" ("course_id", "name", "week", "date", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["course_id", 4400], ["name", "Antoher one"], ["week", 0.0], ["date", "2016-08-11"], ["user_id", 2], ["created_at", "2016-08-11 21:16:32.391331"], ["updated_at", "2016-08-11 21:16:32.391331"]]

  def update
    respond_to do |format|
      if @lesson.update(lesson_params)
---
UPDATE "lessons" SET "image_file_name" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "lessons"."id" = ?  [["image_file_name", "_82A2999.JPG"], ["image_file_size", 750418], ["image_updated_at", "2016-08-11 01:27:17.127149"], ["updated_at", "2016-08-11 01:27:17.620027"], ["id", 1]]

  def destroy
    @lesson.destroy
---
DELETE FROM "lessons" WHERE "lessons"."id" = ?  [["id", 1]]

    def set_lesson
      @lesson = Lesson.find(params[:id])
---
SELECT  "lessons".* FROM "lessons" WHERE "lessons"."id" = ? LIMIT 1  [["id", 4]]